[
    {
        "name": "Cloudify Console Overview",
        "id": "overview",
        "steps": [
            {
                "title": "The Cloudify Console",
                "content": "This tour reviews the areas of the Cloudify Console. Let's get started...",
                "target": ".right.menu .helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            },
            {
                "title": "Console pages",
                "content": "Here you can click on a page to work with a specific group of Cloudify actions, such as <b>Local Blueprints</b> or <b>Deployments</b>. Administrators can customize the pages to help streamline your work.",
                "target": ".pages .pageMenuItem",
                "placement": "right"
            },
            {
                "title": "Widgets on the pages",
                "content": "On each page is a set of widgets. Each widget lets you do a specific Cloudify action. Widgets are grouped on the page so that you can easily access related actions. <b>Administrators can also customize the widgets on each page</b> to meet your needs.",
                "target": ".widgetItem",
                "placement": "bottom"
            },
            {
                "title": "Manager services status",
                "content": "Here you can quickly review the status of the Cloudify services to see if there is anything that needs attention.",
                "target": ".right.menu .item",
                "placement": "bottom"
            },
            {
                "title": "Switch to other tenants",
                "content": "If you can access <b>multiple tenants</b> on the Cloudify Manager, here you can select the tenant that you want to work on.",
                "target": ".right.menu .tenantsMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 250
            },
            {
                "title": "Get help",
                "content": "If you need more information about using the Console or the Cloudify Manager, here you can find links to <b>documentation</b>, <b>video tutorials</b>, and <b>knowledge base articles</b>.",
                "target": ".right.menu .helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            },
            {
                "title": "User menu",
                "content": "The user menu here gives you access to <b>customizing pages and page templates</b> if your user roles allow those actions. It is also where you logout.",
                "target": ".right.menu .usersMenu",
                "placement": "bottom",
                "xOffset": -230,
                "arrowOffset": 250
            },
            {
                "title": "Next steps...",
                "content": "Now that you know the structure of the console, <b>check out other tours</b> about working with the Cloudify Console.",
                "target": ".right.menu .helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            }
        ]
    },
    {
        "name": "Cloudify Console Dashboard",
        "id": "dashboard",
        "steps": [
            {
                "title": "The Cloudify Console Dashboard",
                "content": "The Cloudify Console dashboard contains <b>widgets that do basic actions and show the status</b> of selected tenant. Let's see what the widgets are...",
                "target": ".dashboardPageMenuItem",
                "placement": "right"
            },
            {
                "title": "Tenant resource load",
                "content": "Here you can see how many blueprints, deployments, plugins are available, and you can see how many nodes and executions are running currently. <b>These statistics can indicate the load on the tenant</b>.",
                "target": ".widget.pluginsNumWidget",
                "placement": "bottom"
            },
            {
                "title": "Resource actions",
                "content": "You can <b>upload blueprints, create deployments and upload plugins</b> straight from the dashboard.",
                "target": ".widget.deploymentButtonWidget",
                "placement": "bottom"
            },
            {
                "title": "Execution filters",
                "content": "Here you can filter the executions and events to <b>show only those that are related to a specific blueprint or deployment</b>.",
                "target": ".widget.filterWidget",
                "placement": "top"
            },
            {
                "title": "Executions",
                "content": "These are the executions that the tenant is implementing currently.",
                "target": ".widget.executionsWidget",
                "placement": "top"
            },
            {
                "title": "Events and Logs",
                "content": "These are the events and logs that are generated by the tenant. These events are helpful to <b>see if there are any problems with the tenant functions</b>.",
                "target": ".widget.eventsWidget",
                "placement": "bottom"
            },
            {
                "title": "Check out another tour",
                "content": "Now that you know how to use the dashboard, <b>check out another tour</b> to see what else you can do with the Cloudify Console.",
                "target": ".ui.dropdown.helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            }
        ]
    },
    {
        "name": "Preliminary Manager Setup",
        "id": "dashboard",
        "steps": [
            {
                "title": "Cloudify Manager Resources",
                "content": "Before you start working with blueprints and deployments, you <b>must setup the resources that the blueprints use</b>. Let's get started...",
                "target": ".right.menu .helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            },
            {
                "title": "Managing tenants and users",
                "content": "Cloudify Manager use <b>tenants</b> for data and user segregation. Before you start using the manager, you must <b>define the tenants that you need on your manager</b>.",
                "target": ".tenant_managementPageMenuItem",
                "placement": "right"
            },
            {
                "title": "Add tenants",
                "content": "Add tenants to the manager. Each tenant contains a separate set of users, plugins, secrets, blueprints and deployments. For more information about sharing resources between tenants, see <b>resource visibility</b> in the documenation.",
                "target": "On tenant page - tenant management - Add button",
                "placement": "left"
            },
            {
                "title": "Add user groups",
                "content": "You can create user groups on the current tenant and assign privileges to the group. Users in a group inherit the privileges of the group.",
                "target": "On tenant page - user groups management - Add button",
                "placement": "left"
            },
            {
                "title": "Add users",
                "content": "The users that you add are assigned the specified privileges on the current tenant.",
                "target": "On tenant page - user management - Add button",
                "placement": "left"
            },
            {
                "title": "System Resources",
                "content": "After you setup your tenants and users, go to <b>System Resources</b> to setup the plugins and secrets that you need for your blueprints.",
                "target": ".system_resourcesPageMenuItem",
                "placement": "right"
            },
            {
                "title": "Plugins",
                "content": "Plugins let your blueprints integrate with third-party services and run operations. The plugins required by a blueprint that are specified in the blueprint yaml file must be uploaded to the tenant that the blueprint is deployed on.",
                "target": "System Resources page - Plugins",
                "placement": "bottom"
            },
            {
                "title": "Upload a plugin",
                "content": "When you know which plugins your blueprints need, upload them to the tenant.",
                "target": "System Resources page - Plugins - Upload",
                "placement": "bottom"
            },
            {
                "title": "Add secrets",
                "content": "Blueprints use the <i>get_secret</i> function to get values from the secrets store. That way you do not have to store sensitive information in plain text in the blueprint.",
                "target": "System Resources page - Secrets - Create",
                "placement": "bottom",
            },
            {
                "title": "Check out another tour",
                "content": "Now that you know how to setup your manager resources, <b>check out other help resources</b> to see what else you can do with the Cloudify Console.",
                "target": ".ui.dropdown.helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            }
        ]
    }

]