[
    {
        "name": "Cloudify Console Overview",
        "id": "overview",
        "steps": [
            {
                "title": "The Cloudify Console",
                "content": "This tour reviews the areas of the Cloudify Console. Let's get started...",
                "target": ".logo",
                "placement": "bottom"
            },
            {
                "title": "Console pages",
                "content": "Here you can click on a page to work with a specific group of Cloudify actions, such as Local Blueprints or Deployments. Administrators can customize the pages to help streamline your work.",
                "target": ".pages .pageMenuItem",
                "placement": "right"
            },
            {
                "title": "Widgets on the pages",
                "content": "On each page is a set of widgets. Each widget lets you do a specific Cloudify action. Widgets are grouped on the page so that you can easily access related actions. Administrators can also customize the widgets on each page to meet your needs.",
                "target": ".widgetItem",
                "placement": "bottom"
            },
            {
                "title": "Manager Services Status",
                "content": "Here you can quickly review the status of the Cloudify services to see if there is anything that needs attention.",
                "target": ".right.menu .item",
                "placement": "bottom"
            },
            {
                "title": "Switch to other tenants",
                "content": "If you can access multiple tenants on the Cloudify Manager, here you can select the tenant that you want to work on.",
                "target": ".right.menu .tenantsMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 250
            },
            {
                "title": "Get help",
                "content": "If you need more information about using the Console or the Cloudify Manager, here you can find links to documentation, video tutorials, and knowledge base articles.",
                "target": ".right.menu .helpMenu",
                "placement": "bottom",
                "xOffset": -200,
                "arrowOffset": 210
            },
            {
                "title": "User menu",
                "content": "The user menu here gives you access to customizing pages and page templates if your user roles allow those actions. It is also where you logout.",
                "target": ".right.menu .usersMenu",
                "placement": "bottom",
                "xOffset": -230,
                "arrowOffset": 250
            }
        ]
    }
]